<template>
  <MermaidChart :chartDefinition="chartDefinition" />
</template>

<script>
import MermaidChart from './MermaidChart.vue';

export default {
  components: {
    MermaidChart,
  },
  data() {
    return {
      chartDefinition: `
      %%{init: {'theme': 'forest', 'themeVariables': { 'fontSize': '10px'}, 'flowchart':{'nodeSpacing':120, 'rankSpacing':30}}}%%
          graph LR
            0[投产指令单创建] --> 1[投产指令单下发]
            1 --> 2[面料单位用量计算]
            2 --> 3[面料单位用量下发]
            3 --> 4[一次BOM填写]
            4 --> 5[一次BOM下发]
            5 --> 6[一次采购订单创建]
            6 --> 7[一次采购订单下发]
            7 --> 8[一次采购入库]
            3 --> 9[技术部调版分配] --> 10[技术部调版下发]
            10 --> 11[二次BOM填写]
            11 --> 12[二次BOM下发]
            12 --> 13[二次采购订单创建]
            13 --> 14[二次采购订单下发]
            14 --> 15[二次采购入库]
            16[材料到齐通知]
            10 --> 18
            1 --> 17
            8 --> 16
            15 --> 16
            18 --> 20
            17[生产排期，分配] --> 18[生产开始]
            18 --> 23[裁断开始]
            19[裁断材料出库] --> 23
            20[裁断，批皮工价填报] --> 21[财务部审核]
            21 --> 22[生产副总审核]
            22 --> 23
            23 --> 24[裁断结束]
            24 --> 25[批皮开始]
            25 --> 26[批皮结束]
            26 --> 28
            26 --> 31[针车预备开始]
            27[针车材料出库] --> 31
            28[针车及预备工序填报] --> 29[财务部审核]
            29 --> 30[生产副总审核]
            30 --> 31
            31 --> 32[针车预备结束]
            32 --> 33[针车开始]
            33 --> 34[针车结束]
            34 --> 39[成型开始]
            35[成型材料出库] --> 39
            34 --> 36
            36[成型工价填报] --> 37[财务部审核]
            37 --> 38[生产副总审核]
            38 --> 39
            39 --> 40[成型结束]
            40 --> 41[生产结束]
        `,
    };
  },
};
</script>